In [14]:
import pandas as pd
import numpy as np

In [15]:
df = pd.DataFrame({
    'NAZWA': ['JABŁKA', 'GRUSZKI', 'MALINY'],
    'CENA': ['zł 3.22', 'zł 3.22',  'zł 3.22']
})
df

     NAZWA     CENA
0   JABŁKA  zł 3.22
1  GRUSZKI  zł 3.22
2   MALINY  zł 3.22

In [16]:
remove_zl = lambda x: float(x[3:])

In [17]:
df['CENA_W_ZL'] = df.CENA.apply(remove_zl)
df

     NAZWA     CENA  CENA_W_ZL
0   JABŁKA  zł 3.22       3.22
1  GRUSZKI  zł 3.22       3.22
2   MALINY  zł 3.22       3.22

In [18]:
data = {
    'Name': ['Microsoft Corporation', 'Google, LLC', 'Tesla, Inc.',\
             'Apple Inc.', 'Netflix, Inc.'],
    'Symbol': ['MSFT', 'GOOG', 'TSLA', 'AAPL', 'NFLX'],
    'Industry': ['Tech', 'Tech', 'Automotive', 'Tech', 'Entertainment'],
    'Shares': [100, 50, 150, 200, 80],
    'Shares2': [1000, 500, 1500, 2000, 800]
}
df = pd.DataFrame(data)
dfdata = {
    'Name': ['Microsoft Corporation', 'Google, LLC', 'Tesla, Inc.',\
             'Apple Inc.', 'Netflix, Inc.'],
    'Symbol': ['MSFT', 'GOOG', 'TSLA', 'AAPL', 'NFLX'],
    'Industry': ['Tech', 'Tech', 'Automotive', 'Tech', 'Entertainment'],
    'Shares': [100, 50, 150, 200, 80],
    'Shares2': [1000, 500, 1500, 2000, 800]
}
df = pd.DataFrame(data)
df

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
2            Tesla, Inc.   TSLA     Automotive     150     1500
3             Apple Inc.   AAPL           Tech     200     2000
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [19]:
df[ ~(df.Shares > 100) & (df.Shares != 500)]

                    Name Symbol       Industry  Shares  Shares2
0  Microsoft Corporation   MSFT           Tech     100     1000
1            Google, LLC   GOOG           Tech      50      500
4          Netflix, Inc.   NFLX  Entertainment      80      800

In [20]:
ls data

chipotle.tsv       dane_sprzedaz.csv  parking.csv        rating.csv

In [23]:
df = pd.read_csv("data/dane_sprzedaz.csv", encoding="utf-8")